# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

k = int(input('Введите число: '))
lst1 = [0, 1]
lst2 = [0, 1]

for i in range(2, k+1):
    lst1.append(lst1[i-1] + lst1[i-2])

for i in range (2, k +1):
    lst2.append(lst2[i-2] - lst2[i-1])

lst2.reverse()

print(lst2 + lst1[1:])